index.org
#+TITLE: Hideki Takeoka (aka. camparijet)
#+EXCLUDE_TAGS: private draft
#+OPTIONS: author:nil creator:nil num:nil todo:nil ^:nil timestamp:nil

#+BEGIN_HTML
<!--header-->
<link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?">
<link rel="stylesheet" href="root.css">
#+END_HTML

* Profile
  - Github: https://github.com/
  - blogger: https://iam-gevanni.blogspot.de/
  - Linkedin: https://www.linkedin.com/in/hideki-takeoka-40435031/

* Job History
** Panono GmbH: Head of Firmware Development
   - date: <2014-05-01 Thu>--(now)
   - company: Panono GmbH
   - mission: produce best quality 360 photo camera in the world (and free users from annoying manual stitching)
   - key technology: C/C++, embedded system, Websocket, multicast

** Recruit Lifestyle Co., Ltd: Junior Data Analyst
   - date: <2013-04-01 Mon>--<2014-04-30 Wed>
   - company: Recruit Lifestyle Co., Ltd
   - mission: optimize matching experience between website visitors and business partners.
   - key technology: recommend engine, Statistics, SQL, R

** Exploratory IT Human Resources Project Information technology Promotion Agency ,Japan
   - date: <2012-12-01>--<2013-09-30>
   - company: Information technology Promotion Agency ,Japan
     - project: https://www.ipa.go.jp/english/humandev/third.html
     - project: https://www.ipa.go.jp/about/press/20120124.html
   - mission: ballcam: throwable highspeed multiple camera unit

** RIKEN: Programmer
   - date: <2010-04-01 Thu>--<2011-10-31 Mon>
   - company: RIKEN
   - mission: create and validate Kuramoto oscillators

** HEARTBEATS Corporation: Server monitoring Operator
   - date: <2006-09-01 Thu>--<2007-09-01 Sat>
   - company: HEARTBEATS Corporation
   - mission: first operation on server troubles
   - key technology: monitoring agent (i.e. Zabbix/Nagios ...), Unix/Linux basic skills, build from source/maintenance LAMP environment.

* Contribution
** Development
*** Firefox
    - Refuse ws messages that don't use minimal encoding
      - issue: https://bugzilla.mozilla.org/show_bug.cgi?id=1351948
      - patch: https://hg.mozilla.org/mozilla-central/rev/6553dcb0df0c
      - backstage story:

** Security Report
*** Malcious ad via ad network
    - report: https://iam-gevanni.blogspot.de/2017/03/how-advertisement-hijack-ads-owners.html
    - update by Mathtag: https://iam-gevanni.blogspot.de/2017/03/malcious-ad-is-now-removed-by-media-math.html

* Education
** The University of Tokyo: Master Degree (Information Technology)
   <2010-04-01 Thu>--<2012-03-31 Sat>

*** highspeed throwable camera system

   - mission: generate Panorama and 3D point of cloud of surrounding environment within 1 sec
   - key technology: image processing, embedded linux, linear- and non-leanier optimization, statistic
   - Project Homepage: http://www.k2.t.u-tokyo.ac.jp/vision/TossCam/index-e.html
   - Publish: https://dl.acm.org/citation.cfm?id=2077383

** The University of Tokyo: Bachelor (Engineering)
   <2006-04-01 Sat>--<2010-03-31 Sat>

