index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Hideki Takeoka (aka. camparijet)</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?"></link>
</head>
<body>
<div id="content">
<h1 class="title">Hideki Takeoka (aka. camparijet)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Profile</a></li>
<li><a href="#sec-2">Job</a>
<ul>
<li><a href="#sec-2-1">Head of Firmware Development</a></li>
<li><a href="#sec-2-2">Junior Data Analyst</a></li>
<li><a href="#sec-2-3">Exploratory IT Human Resources Project Information technology Promotion Agency ,Japan</a></li>
<li><a href="#sec-2-4">Programmer</a></li>
<li><a href="#sec-2-5">Server monitoring Operator</a></li>
</ul>
</li>
<li><a href="#sec-3">Contribution</a>
<ul>
<li><a href="#sec-3-1">Development</a>
<ul>
<li><a href="#sec-3-1-1">Firefox</a></li>
</ul>
</li>
<li><a href="#sec-3-2">Security Report</a>
<ul>
<li><a href="#sec-3-2-1">Malcious ad via ad network</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">Education</a>
<ul>
<li><a href="#sec-4-1">The University of Tokyo: Master Degree (Information Technology)</a>
<ul>
<li><a href="#sec-4-1-1">highspeed throwable camera system</a></li>
</ul>
</li>
<li><a href="#sec-4-2">The University of Tokyo: Bachelor (Engineering)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Profile</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Github: <a href="https://github.com/">https://github.com/</a>
</li>
<li>blogger: <a href="https://iam-gevanni.blogspot.de/">https://iam-gevanni.blogspot.de/</a>
</li>
<li>Linkedin: <a href="https://www.linkedin.com/in/hideki-takeoka-40435031/">https://www.linkedin.com/in/hideki-takeoka-40435031/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Job</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Head of Firmware Development</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-05-01 Thu&gt;</span></span>&#x2013;(now)
</li>
<li>company: Panono GmbH
</li>
<li>mission: produce best quality 360 photo camera in the world (and free users from annoying manual stitching)
</li>
<li>key technology: C/C++, embedded system, Websocket, multicast
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Junior Data Analyst</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2013-04-01 Mon&gt;&#x2013;&lt;2014-04-30 Wed&gt;</span></span>
</li>
<li>company: Recruit Lifestyle Co., Ltd
</li>
<li>mission: optimize matching experience between website visitors and business partners.
</li>
<li>key technology: recommend engine, Statistics, SQL, R
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Exploratory IT Human Resources Project Information technology Promotion Agency ,Japan</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2012-12-01 Sat&gt;&#x2013;&lt;2013-09-30 Mon&gt;</span></span>
</li>
<li>company: Information technology Promotion Agency ,Japan
<ul class="org-ul">
<li>project: <a href="https://www.ipa.go.jp/english/humandev/third.html">https://www.ipa.go.jp/english/humandev/third.html</a>
</li>
<li>project: <a href="https://www.ipa.go.jp/about/press/20120124.html">https://www.ipa.go.jp/about/press/20120124.html</a>
</li>
</ul>
</li>
<li>mission: ballcam: throwable highspeed multiple camera unit
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Programmer</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2010-04-01 Thu&gt;&#x2013;&lt;2011-10-31 Mon&gt;</span></span>
</li>
<li>company: RIKEN
</li>
<li>mission: create and validate Kuramoto oscillators
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Server monitoring Operator</h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li>date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2006-09-01 Fri&gt;&#x2013;&lt;2007-09-01 Sat&gt;</span></span>
</li>
<li>company: HEARTBEATS Corporation
</li>
<li>mission: first operation on server troubles
</li>
<li>key technology: monitoring agent (i.e. Zabbix/Nagios &#x2026;), Unix/Linux basic skills, build from source/maintenance LAMP environment.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Contribution</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Development</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Firefox</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Refuse ws messages that don't use minimal encoding
<ul class="org-ul">
<li>issue: <a href="https://bugzilla.mozilla.org/show_bug.cgi?id=1351948">https://bugzilla.mozilla.org/show_bug.cgi?id=1351948</a>
</li>
<li>patch: <a href="https://hg.mozilla.org/mozilla-central/rev/6553dcb0df0c">https://hg.mozilla.org/mozilla-central/rev/6553dcb0df0c</a>
</li>
<li>backstage story:
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Security Report</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">Malcious ad via ad network</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>report: <a href="https://iam-gevanni.blogspot.de/2017/03/how-advertisement-hijack-ads-owners.html">https://iam-gevanni.blogspot.de/2017/03/how-advertisement-hijack-ads-owners.html</a>
</li>
<li>update by Mathtag: <a href="https://iam-gevanni.blogspot.de/2017/03/malcious-ad-is-now-removed-by-media-math.html">https://iam-gevanni.blogspot.de/2017/03/malcious-ad-is-now-removed-by-media-math.html</a>
</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Education</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">The University of Tokyo: Master Degree (Information Technology)</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2010-04-01 Thu&gt;&#x2013;&lt;2012-03-31 Sat&gt;</span></span>
</p>
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1">highspeed throwable camera system</h4>
<div class="outline-text-4" id="text-4-1-1">
<ul class="org-ul">
<li>mission: generate Panorama and 3D point of cloud of surrounding environment within 1 sec
</li>
<li>key technology: image processing, embedded linux, linear- and non-leanier optimization, statistic
</li>
<li>Project Homepage: <a href="http://www.k2.t.u-tokyo.ac.jp/vision/TossCam/index-e.html">http://www.k2.t.u-tokyo.ac.jp/vision/TossCam/index-e.html</a>
</li>
<li>Publish: <a href="https://dl.acm.org/citation.cfm?id=2077383">https://dl.acm.org/citation.cfm?id=2077383</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">The University of Tokyo: Bachelor (Engineering)</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2006-04-01 Sat&gt;&#x2013;&lt;2010-03-31 Wed&gt;</span></span>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
